# 1- Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# 'абвгдейка - это передача' = >" - это передача"


import random

Text = "абвгдейка сезам - это абв передача"
List = ' '.join(list(filter(lambda x: not 'абв' in x, Text.split(' '))))
print(List)